       A     B     C    D
0    1.0   2.0   3.0  4.0
1    5.0   6.0   NaN  8.0
2   10.0  11.0  12.0  NaN

    A    0
B        0
C        1
D        1
dtype: int64

       A    B    C    D
0    1.0  2.0  3.0  4.0

In [4]:
#================
# dropping columns with missing values
df.dropna(axis=1)
#===================

       A     B
0    1.0   2.0
1    5.0   6.0
2   10.0  11.0

In [5]:
#===================
# dropping all rows where all columns are NaN
df.dropna(how='all')
#==================

       A     B     C    D
0    1.0   2.0   3.0  4.0
1    5.0   6.0   NaN  8.0
2   10.0  11.0  12.0  NaN

In [6]:
#=======================
# drop rows that have less than 4 real values
df.dropna(thresh=4)
#========================

       A    B    C    D
0    1.0  2.0  3.0  4.0

In [7]:
#==========================
# only drop rows where NaN appear in specific columns
df.dropna(subset=['C'])
#===========================

       A     B     C    D
0    1.0   2.0   3.0  4.0
2   10.0  11.0  12.0  NaN

In [13]:
#========================
# using imputer
'''
from sklearn.impute import SimpleImputer
imr=SimpleImputer(missing_values='NaN',strategy='mean')
imr=imr.fit_transform(df.values)
imputed_data=imr.transform(df.values)
imputed_data
#==============================
'''

"\nfrom sklearn.impute import SimpleImputer\nimr=SimpleImputer(missing_values='NaN',strategy='mean')\nimr=imr.fit_transform(df.values)\nimputed_data=imr.transform(df.values)\nimputed_data\n#==============================\n"